# !/usr/bin/env python3
# coding: utf-8

#1 Написать программу, которая принимает от пользователя текстовую строку и выводит на экран её длину.

user_input = input('введите строку: ')
print('длина введённой строки: ', len(user_input))

# 2. Написать программу, которая принимает от пользователя текстовую строку и выводит её длину без учёта пробелов.

user_input = input('введите строку с пробелами: ')
print('длина строки без учёта пробелов:', str(len(user_input)-user_input.count(' ')))

# 3. Написать программу, которая принимает от пользователя текстовую строку и символ и выводит на экран количество вхождений символа в строку.

user_input = input('введите строку: ')
char_input = input('введите символ: ')
print('символ', char_input, 'входит', user_input.count(char_input), 'раз в строку', user_input)

# 5 Написать программу, которая принимает строку и выводит её в обратном порядке.

user_input = input('введите строку: ')
print("строка в обратном порядке", user_input[-1:-600:-1])

